app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        $data['total_bahan'] = $db->table('bahan_baku')->countAll();

        $data['total_produksi'] = $db->table('produksi')->countAll();

        $data['total_distribusi'] = $db->table('distribusi')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `bahan_baku`
SELECT COUNT(*) AS `numrows` FROM `produksi`
SELECT COUNT(*) AS `numrows` FROM `distribusi`