app/Controllers/Distribusi.php

    public function index()
    {
        $db = \Config\Database::connect();

        $data['distribusi'] = $db->table('distribusi')
            ->join('produksi', 'produksi.id = distribusi.produksi_id')
            ->join('bahan_baku', 'bahan_baku.id = produksi.bahan_baku_id')
            ->select('distribusi.*, bahan_baku.kode_batch')
            ->get()
            ->getResultArray();
---
SELECT `distribusi`.*, `bahan_baku`.`kode_batch`
FROM `distribusi`
JOIN `produksi` ON `produksi`.`id` = `distribusi`.`produksi_id`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `produksi`.`bahan_baku_id`

    public function create()
    {
        $db = \Config\Database::connect();

        $data['produksi'] = $db->table('produksi')
            ->join('bahan_baku', 'bahan_baku.id = produksi.bahan_baku_id')
            ->select('produksi.*, bahan_baku.kode_batch')
            ->get()
            ->getResultArray();
---
SELECT `produksi`.*, `bahan_baku`.`kode_batch`
FROM `produksi`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `produksi`.`bahan_baku_id`

    public function store()
    {
        $model = new DistribusiModel();

        $produksi_id = $this->request->getPost('produksi_id');

     $tracking_url = base_url('/tracking/' . $produksi_id);

$qr = new QrCode($tracking_url);

$writer = new SvgWriter();

$result = $writer->write($qr);

$filename = 'qr_' . time() . '.svg';

$result->saveToFile(FCPATH . 'qrcode/' . $filename);

        $model->save([
            'produksi_id'   => $produksi_id,
            'nama_toko'     => $this->request->getPost('nama_toko'),
            'tanggal_kirim' => $this->request->getPost('tanggal_kirim'),
            'qr_code'       => $filename
        ]);
---
INSERT INTO `distribusi` (`produksi_id`, `nama_toko`, `tanggal_kirim`, `qr_code`) VALUES ('4', 'Toko ibu', '2026-05-30', 'qr_1780017611.svg')