app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'toko'
AND `password` = '123'
 LIMIT 1
---
    public function process()
    {
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model
            ->where('username', $username)
            ->where('password', $password)
            ->first();