app/Controllers/Produksi.php

    public function index()
    {
        $db = \Config\Database::connect();

        $data['produksi'] = $db->table('produksi')
            ->join('bahan_baku', 'bahan_baku.id = produksi.bahan_baku_id')
            ->select('produksi.*, bahan_baku.kode_batch, bahan_baku.nama_petani')
            ->get()
            ->getResultArray();
---
SELECT `produksi`.*, `bahan_baku`.`kode_batch`, `bahan_baku`.`nama_petani`
FROM `produksi`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `produksi`.`bahan_baku_id`

    public function create()
    {
        $bahanModel = new BahanBakuModel();

        $data['bahan'] = $bahanModel->findAll();
---
SELECT *
FROM `bahan_baku`

    public function store()
    {
        $model = new ProduksiModel();

        $model->save([
            'bahan_baku_id'   => $this->request->getPost('bahan_baku_id'),
            'tingkat_sangrai' => $this->request->getPost('tingkat_sangrai'),
            'tanggal_produksi'=> $this->request->getPost('tanggal_produksi'),
        ]);
---
INSERT INTO `produksi` (`bahan_baku_id`, `tingkat_sangrai`, `tanggal_produksi`) VALUES ('5', 'light roast', '2026-05-29')